<?
    //──────────────────────────────────────────────────────────────────────────────────────
    // 배열안에 삽입 될 레코드값 선언
    //──────────────────────────────────────────────────────────────────────────────────────
    include "data_information.php";
    //──────────────────────────────────────────────────────────────────────────────────────
    switch($_GET['action']) {
        //──────────────────────────────────────────────────────────────────────────────────────
        // action 모드 insert 쿼리문 실행
        //──────────────────────────────────────────────────────────────────────────────────────
        case "insert":
            $register_sql = ("INSERT INTO user_info 
                                (
                                 user_id,           password,      user_name,      gender,      email,     
                                 user_tel_number,   user_grade,    visit_day,      reg_date,    ip
                                ) 
                                VALUES 
                                (
                                 :user_id,          :password,      :user_name,     :gender,    :email,     
                                 :user_tel_number,  :user_grade,    :visit_day,     :reg_date,  :ip
                                )"
                            ); 
            $stmt = $conn -> prepare($register_sql); 
            $stmt -> execute($register_data);

            echo "<script> 
                alert($user_id + '님 회원가입이 완료되었습니다.\\n다시 로그인해주세요.'); 
                window.location.href = '?mode=login';
            </script>";
            break;
        //──────────────────────────────────────────────────────────────────────────────────────
        // action 모드 update 쿼리문 실행
        //──────────────────────────────────────────────────────────────────────────────────────
        case "update":
            break;
        //──────────────────────────────────────────────────────────────────────────────────────
        // action 모드 delete 쿼리문 실행
        //──────────────────────────────────────────────────────────────────────────────────────
        case "delete":
            echo "delete";
            break;
    }
?>